Autodesk.Revit.Creation.Application.NewPlane(Autodesk.Revit.DB.CurveArray)
Creates a new geometric plane from a loop of planar curves.
curveloop:  The closed loop of planar curves to locate plane.
Returns:  If successful a new geometric plane will be returned. Otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input curve loop is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input curve loop does not lie in a plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input curve loop is not closed.

Autodesk.Revit.Creation.Application.NewPlane(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric plane object based on a normal vector and an origin.
norm: Z vector of the plane coordinate system.
origin: Origin of the plane coordinate system.
Returns: A new plane object.

Autodesk.Revit.Creation.Application.NewPlane(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new geometric plane object.
Creates a new geometric plane object based on two coordinate vectors and an origin.
xVec: X vector of the plane coordinate system.
yVec: Y vector of the plane coordinate system.
origin: Origin of the plane coordinate system.
Returns: A new plane object.